---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementIdParameterValue
source: html/05532128-d025-f7ac-f96b-9513ae90d25c.htm
---
# ElementIdParameterValue Methods

Makes an identical copy of the given parameter value.